Removes a filter from the view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public void RemoveFilter(
	ElementId filterElementId
)
  Visual Basic
Public Sub RemoveFilter ( _
	filterElementId As ElementId _
)
  Visual C++
public:
void RemoveFilter(
	ElementId^ filterElementId
)
 Parameters
  filterElementId
 Type:  Autodesk.Revit.DB ElementId
 ElementId of the filter.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentException   |   Filter is not applied to the view. -or- ElementId is not associated with a FilterElement.
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
   Autodesk.Revit.Exceptions InvalidOperationException   |   View does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes.
 See Also
  View Class
  Autodesk.Revit.DB Namespace